# Assignment #8 - Data Gathering and Warehousing - DSSA-5102

Instructor: Melissa Laurino</br>
Spring 2025</br>

Name: Adriana Alfaro
</br>
Date: 4/14/2025
<br>
<br>
**At this time in the semester:** <br>
- We have explored a dataset. <br>
- We have cleaned our dataset. <br>
- We created a Github account with a repository for this class and included a metadata read me file about our data. <br>
- We introduced general SQL syntax, queries, and applications in Python.<br>
- Created our own databases from scratch using MySQL Workbench and Python with SQLAlchemy on our local server and locally on our machine.
- Populated our databases with the data we cleaned at the start of the semester.
<br>

Now we will **JOIN** our knowledge and tables to answer more complex questions about our dataset! We will practice joining tables and understand the importance of using different commands.<br>

JOIN statements are used to combine results from two or more tables based on a related column between them.<br>

Review the powerpoint and readings specified on Blackboard.<br>

In the event your database does not meet the requirements below to answer the question, please use the database provided in Assignment #4 and #5. Remember to credit your data source. <br>

Follow the instructions below to complete the assignment. Write your question you are answering with your data query and visualize your results in a way that fits your data. <br>
Be sure to comment **all** code and answer **all** questions in markdown for full credit.<br>

**Data origin:** 
coffee_sales_db from kaggle: https://www.kaggle.com/datasets/ahmedabbas757/coffee-sales

In [6]:
# Import database navigation
from sqlalchemy import create_engine, Column, String, Integer, Boolean, BigInteger, Float, text # Database navigation

# Import pandas 
import pandas as pd

#reconnect to database
engine = create_engine("mysql+mysqlconnector://root:575110@localhost/coffee_sales_db")

#### INNER JOIN (or JOIN)
Display matching records from TWO tables! Choose to combine two tables using inner join. <br>
Write your question you are answering with your data query and visualize your results. <br>
<br>
**Example Question:** What were the songs most listened to during this week in the year 2022?
<br>
**What tables are we joining?** song and listening_history

In [9]:
# question: what were the most sold products in January of 2023?
# joining transactions and products 

query = """
SELECT 
  products.product_type,
  SUM(transactions.transaction_qty) AS total_sold
FROM transactions 
JOIN products
  ON transactions.product_id = products.product_id
WHERE MONTH(transaction_date) = 1 
  AND YEAR(transaction_date) = 2023
GROUP BY products.product_type
ORDER BY total_sold DESC
LIMIT 10;
"""
#selects product names from the product table
#sums up transaction_qty to collect how much of each product was sold renames as total_sold
#joins transactions and product table, with the match being product_id
#only includes transaction dates of Jan (1) of 2023
#grouping each product by their total sum, (total sales)
# orders by most sold product at the top
# grabs the first 10 products into view


# run using SQLAlchemy Engine
with engine.begin() as connection:
    result = pd.read_sql(query, connection)

result.head(10)

            product_type  total_sold
0       Barista Espresso      3261.0
1  Gourmet brewed coffee      3018.0
2        Brewed Chai tea      3011.0
3                  Scone      2543.0
4          Hot chocolate      2015.0
5       Brewed Black tea      2014.0
6      Brewed herbal tea      1983.0
7  Organic brewed coffee      1584.0
8                 Pastry      1560.0
9  Premium brewed coffee      1453.0

#### LEFT JOIN
<br>
Returns ALL records from the left table and matching records from the right table. Write your question you are answering with your data query and visualize your results.. 
<br><br>
**Question:** What day of the week were the most songs played?
<br>
**What tables are we joining?** song and listening_history

In [89]:
# question: show all stores and their total transactions
# joining stores and transactions

query = """
SELECT
    stores.store_id,
    stores.store_location,
    COUNT(transactions.transaction_id) AS num_transactions
FROM stores
LEFT JOIN transactions
    ON stores.store_id = transactions.store_id
GROUP BY stores.store_id, stores.store_location
ORDER BY num_transactions DESC;  
"""
# select, store id, location and sum of transactions
# start with full list of stores before joining
# left join transactions on store id, linking each store to its transaction
# group by store so to count how many each store had
# order by, storting the most active store to least


# run using SQLAlchemy Engine
with engine.begin() as connection:
    result = pd.read_sql(query, connection)

result.head()

   store_id   store_location  num_transactions
0         8   Hell's Kitchen             50735
1         3          Astoria             50599
2         5  Lower Manhattan             47782

#### RIGHT JOIN
<br>
Returns ALL records from the right table and matching records from the left table. Write your question you are answering with your data query and visualize your results.. <br>
<br>
**Question:** What were the days of the week and artists listened to on Sundays? Include all listening history for those times.
<br>
**What tables are we joining?** song and listening_history

In [92]:
# question: What are the least sold products in the entire catalog? 
# joining products and transactions

query = """
SELECT 
  products.product_id,
  products.product_type,
  COUNT(transactions.transaction_id) AS times_sold
FROM products
RIGHT JOIN transactions
  ON products.product_id = transactions.product_id
GROUP BY products.product_id, products.product_type
ORDER BY times_sold ASC
LIMIT 10;
"""
# start from products table
# join it with transactions to count how many times each product was sold
# use right join to make sure to list all products 
# group by product to count sales 
# order by decreasing sales 

# run using SQLAlchemy Engine
with engine.begin() as connection:
    result = pd.read_sql(query, connection)

result.head(10)

   product_id        product_type  times_sold
0          19  Drinking Chocolate         118
1          18            Chai tea         122
2          10         Green beans         134
3          14           Black tea         142
4           7       Premium Beans         146
5          21  Drinking Chocolate         148
6           5       Gourmet Beans         148
7           4      Espresso Beans         150
8          11          Herbal tea         152
9          16            Chai tea         153

#### FULL JOIN or UNION of RIGHT JOIN and LEFT JOIN
<br>
Can answer multiple objectives at the same time! Not recommended for large databases. Results may slow your machine or quit before finishing. Write your question you are answering with your data query and visualize your results. <br>
<br>
**Question:** What artists were listened to on Sundays and what are the listening_history details in the year 2021? Let's save this as a dataframe and determine which artist contained the most "trackdone" (Listened to the entire song).
<br>
**What tables are we joining?** song and listening_history

In [95]:
# question: all the products we offer and their total transactions
# using FULL OUTER JOIN combining products and transactions

query = """
SELECT 
  product_type,
  COUNT(transaction_id) AS total_transactions
FROM (
  SELECT 
    p.product_type,
    t.transaction_id
  FROM products p
  LEFT JOIN transactions t ON p.product_id = t.product_id

  UNION

  SELECT 
    p.product_type,
    t.transaction_id
  FROM products p
  RIGHT JOIN transactions t ON p.product_id = t.product_id

) AS all_data

GROUP BY product_type
ORDER BY total_transactions DESC;
"""

# select product types and count their total transactions as total_transactions
# left joing retreives all product and transactions linked to them
# right join grabs all transactions and matches them to product info 
# union merges both LEFT JOIN and RIGHT JOIN 
# group by product type and count how many transactions each one have
# order by descending order

# run using SQLAlchemy Engine
with engine.begin() as connection:
    result = pd.read_sql(query, connection)

result.head(29) #there are 29 products total

             product_type  total_transactions
0         Brewed Chai tea               17183
1   Gourmet brewed coffee               16912
2        Barista Espresso               16403
3           Hot chocolate               11468
4        Brewed Black tea               11350
5       Brewed herbal tea               11245
6                   Scone               10173
7   Organic brewed coffee                8489
8             Drip coffee                8477
9   Premium brewed coffee                8135
10                 Pastry                6912
11               Biscotti                5711
12       Brewed Green tea                5671
13          Regular syrup                4979
14       Sugar free syrup                1811
15             Housewares                 526
16               Chai tea                 443
17          Organic Beans                 415
18          Gourmet Beans                 366
19          Premium Beans                 336
20         Espresso Beans                 319
21             Herbal tea                 305
22              Black tea                 303
23     Drinking Chocolate                 266
24      Organic Chocolate                 221
25               Clothing                 221
26      House blend Beans                 183
27              Green tea                 159
28            Green beans                 134

In [96]:
# Close your connection :)
connection.close()